'''
    변수 / 연산자 / 제어문 / 배열
    ---------------------------- 함수
    변수 :
            변수명=값 => 값에 따라서 자동 저장
            문자열 => "" . ''
            숫자 => 10,10.5
            boolean => True / False
    연산자 :
        산술 => + - * / // % **
        비교 => == , !=, < , > ,<= , >=
        논리 => and , or , not
        대입 => += , -=
    제어문 :
        if
            if 조건문:
                처리문장
        if~else
            if 조건문:
                처리문장
            else:
                처리문장
        if ~ elif ~ elif ~ else
            if 조건문:
                처리문장
            elif 조건문:
                처리문장
            else:
                처리문장
'''